Revit 2027 API
SpecTypeId.Current Property
 Current, in discipline Electrical.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId Current { get; }
Public Shared ReadOnly Property Current As ForgeTypeId
	Get
public:
static property ForgeTypeId^ Current {
	ForgeTypeId^ get ();
}
static member Current : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SpecTypeId Class
Autodesk.Revit.DB Namespace